MORSE = {'A': '.-', 'B': '-...', 'C': '-.-.',
         'D': '-..', 'E': '.', 'F': '..-.',
         'G': '--.', 'H': '....', 'I': '..',
         'J': '.---', 'K': '-.-', 'L': '.-..',
         'M': '--', 'N': '-.', 'O': '---',
         'P': '.--.', 'Q': '--.-', 'R': '.-.',
         'S': '...', 'T': '-', 'U': '..-',
         'V': '...-', 'W': '.--', 'X': '-..-',
         'Y': '-.--', 'Z': '--..',

         '0': '-----', '1': '.----', '2': '..---',
         '3': '...--', '4': '....-', '5': '.....',
         '6': '-....', '7': '--...', '8': '---..',
         '9': '----.',

         '.': '.-.-.-', '/': '-..-.', '?': '..--..',
         '@': '.--.-.', ',': '--..--', '\"': '.-..-.',
         '!': '-.-.--', ':': '---...', '=': '-...-',
         '\'': '.----.', '-': '-....-', '_': '..--.-',
         '(': '-.--.', ')': '-.--.-', '+': '.-.-.'
         }
code = '.-- .- .-. -. .. -. --. ---...  -.. ---  -. --- -  .-. . .--. .-.. -.-- -.-.--  -.. ---  -. --- -  .-. . .--. .-.. -.-- -.-.--  -.. ---  -. --- -  .-. . .--. .-.. -.-- -.-.--'
def dtw(getin):
    a=''
    b=[]
    for i in getin:
        if i !=' ':
            a+=i
        else:
            b.append(a)
            b.append(' ')
            a=''
    if a:
        b.append(a)
    def find(d,value):
        if value==' ':
            return None
        else:
            return [k for k, v in d.items() if v == value]
    g=[]
    k=''
    for i in b:
        if i==' ':
            k+=' '
            if len(k)%2!=0:
                g+=' '
        f=(find(MORSE,i))
        if i!=' ':
            g+=f
            k=''
    h=''
    for i in g:
        h+=i
    m=0
    n=''
    for i in h:
        if i==' ':
            m+=1
            if m%2==0:
              n+=' '
        else:
            n+=i
            m=0
    print(n.title())
def wtd(getin):
    for i in getin:
        if i != ' ':
            print(MORSE[i], end=' ')
        else:
            print(' ', end=' ')
print('先给出已给电码的翻译：')
dtw(code)
no=1
try:
    while 1:
        print(f'\n----------------菜单{no}------------------')
        user=input('若要输入英文句子，输出摩尔斯电码字符串的请按1\n若要输入摩尔斯电码字符串，输出英文句子的请按2\n退出请按“q”\n')
        no+=1
        if user!='q':
            if int(user)==1:
                ha=input('请输入英文句子：')
                print('对应的摩尔斯电码翻译为：')
                hei=ha.upper()
                wtd(hei)
            elif int(user)==2:
                ha=input('请输入摩尔斯电码：')
                print('对应英文句子的翻译为：')
                dtw(ha)
            else:
                print('您输入了其他无效数字，请输入1或2，再试一次')
        else:
            print('程序关闭，再见。')
            break
except ValueError:
    print('你输入的错误的内容，请重启程序！')